people/nguyenthanhvuh/old/drafts/program-analysis-notes.org
#+TITLE: Program Analysis Notes
#+date: <2022-09-20 03:39>
#+description: Program Analysis Notes
#+filetags: program-analysis notes blog 

#+HTML_HEAD: <link rel="stylesheet" href="https://dynaroars.github.io/files/org.css">

* Hoare logic
:PROPERTIES:
:CUSTOM_ID: hoare
:END:

Method by [[https://en.wikipedia.org/wiki/Tony_Hoare][Tony Hoare]] to verify that an imperative program is correct with respect to a given specification, i.e., reasoning about program correctness using /pre/ and /post/ conditions.  

** Summary
   - *Goal*: to prove that a program ~S~ is correct with respect to a given precondition ~P~ and postcondition ~Q~.
   - *Method*:
     - Use Hoare tripple to represent ~S,P,Q~ and prove the tripple
     - Compute *weakest precondition* of ~S~ with respect to ~Q~, i.e., ~wp(S, Q)~
     - For every loop in ~S~, need to provide a *loop invariant* 
     - Form *verification condition* (*=vc=*): ~P => wp(S, Q)~
       - If this =vc= is true, then the Hoare tripple is valid, i.e., ~S~ is correct wrt to ~P~ and ~Q~
       - Else, Hoare tripple is invalid but we cannot conclude that ~S~  is incorrect  wrt to ~P~ and ~Q~ (e.g., it could be that we picked a weak loop invariant)

** Hoare Tripple  ~{P} S {Q}~
   - *S*: a program (a list of statements); *P*: precondition (a *formula* that /holds/ before the execution of *S*); *Q*: postcondition (a *formula* that /holds/ after the execution of *S*)
   - Read: assume ~P~ holds, if ~S~ executes successfully (i.e., terminates), then ~Q~ holds
   - Meaning: if the tripple is _valid_, then ~S~ is correct wrt to the program specification (~P~ and ~Q~)
   - E.g., ~{x = 5 and y > 2} z := x + y; z := z + 2 {z > 9}~:   assume ~x=5 and y > 2~, if ~z:x +y; z := z + 2~ runs successfully, then we have ~z > 9~
    
     
** Partial and Total Correctness
   -  *Partial*: assume ~P~ holds and ~S~ /successfully/ executes, ~Q~ holds
     - Here, we *assume* ~P~ and the program terminates (~S~ successfully executed)
   -  *Total*: assume ~P~ holds, if  ~S~ /successfully/ executes, then ~Q~ holds
     - Here, we *require* ~S~ terminates
     - Dififcult because having to ensure the termination of ~S~

   - We often just use partial correctness because total correctness requires us to also prove that S would terminate, which is a difficult problem (theoretically undecidable).
   
*** Examples
**** Consider a program ~S~ with a single assignment statement ~x:=5~.

The Hoare tripple ~{True} x := 5 {x > 6}~ is /not/ a valid tripple, but these next ones are valid:
1. ~{True} x := 5 {x=5 or x= 6 or x > 6}~
1. ~{True} x := 5 {x > 1}~
1. ~{True} x := 5 {x = 5}~
Moreover, the postcondition in ~x=5~ is *strongest* because it is more precise than ~x > 1~ and ~(x=5 or x=6 or x > 6)~.  In general we want the strongest (most precise) postcondition.


**** Consider another program ~z:= x/y~

These are valid Hoare tripples:

1. ~{x = 1 & y = 2} z:= x/y  {z < 1}~
1. ~{x = 2 & y = 4} z:= x/y {z <1}~
1. ~{0 < x < y & y != 0} z:= x/y {z <1}~

Moreover, the precondition ~0 < x < y & y != 0~ is the *weakest* precondition (i.e., it is the least constraint precondition). In general we want the weakest precondition.

These are invalid tripples:

1. ~{x < y} z:= x/y  {z < 1}~ (counterexample input x=-1, y=0,  after executing z:=x/y, we do not have z < 1 and instead got a div-by-0 exception)
1. ~{x = 0} z:= x/y  {z < 1}~ (counterexample input x=0, y=0)
1. ~{y != 0} z:= x/y  {z < 1}~ (counterexample input x=2 , y=1)
1. ~{x < y & y != 0} z:= x/y {z <1}~ (counterexample input   x=-2,  y=-1)

*** In-class Questions

Fill in ~P,S,Q~ to make the following Hoare tripples valid.

1. ~{Q} x:=3 {x = 8}~
 #+begin_comment
 ~Q~ is ~False~. Because the precondition ~False~, i.e., there is no way we can satisfies the precondition in the first place.
 #+end_comment
1. ~{P} x:= y - 3 {x = 8}~
 #+begin_comment   
 ~P~ is ~y = 11~
 #+end_comment      
1. ~{x = y} S {x = y}~
 #+begin_comment   
 ~S~ is ~skip~ (i.e., doesn't do anything)
 #+end_comment
1. ~{x < 0} while(x!=0) do x := x - 1 {Q}~
 #+begin_comment   
 ~Q~ can be any formula. The loop /does not/ terminates so the Hoare tripple is valid no matter what postcondition we use (loop does not terminate violates the assumption of partial correctness).

 Note: this tripple is valid for /partial/ correctness, but is /not/ valid for /total/ correctness.
 #+end_comment

** Computing Weakest Preconditions


We can automatically verify (partial) program correctness using Hoare Triples and weakest preconditions.
To prove ~{P} S {Q}~ is valid, i.e., to prove the program ~S~ is correct wrt to the precondition ~P~ and postcondition ~Q~, we check that ~P => wp(S, Q)~ is valid. Here, the function *wp* returns the weakest precondition allowing the program ~S~ to achieve the postcondition ~Q~.

Thus, to show the validity of ~{P} S {Q}~, we show that ~P~ implies (~=>~) the WP of ~S~ wrt to ~Q~. Hoare defines rules to obtain the WP of different kind of (imperative) program statements as shown below.
