docs/nguyen/posts/program-analysis-notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="Program Analysis Notes">
<link rel="alternate"
      type="application/rss+xml"
      href="./rss.xml"
      title="RSS feed for ./">
<title>Program Analysis Notes</title>
<meta name="author" content="ThanhVu Nguyen">
<meta name="referrer" content="no-referrer">
<link rel="stylesheet" type="text/css" href="https://dynaroars.github.io/files/org.css" />
<link href= "../files/org-orig.css" rel="stylesheet" type="text/css" /> 
<link rel="icon" href="../files/favicon.ico">
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="../index.html">ThanhVu Nguyen</a>,  
  <a href="index.html">Archive</a>
</div>
</div>
<div id="content">
<div class="post-date">20 Sep 2022</div><h1 class="post-title"><a href="./program-analysis-notes.html">Program Analysis Notes</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#hoare">1. Hoare logic</a>
<ul>
<li><a href="#orgbd4c009">1.1. Summary</a></li>
<li><a href="#org1c1d2b7">1.2. Hoare Tripple  <code>{P} S {Q}</code></a></li>
<li><a href="#org07a8791">1.3. Partial and Total Correctness</a>
<ul>
<li><a href="#org4aed904">1.3.1. Examples</a></li>
<li><a href="#org10ecd00">1.3.2. In-class Questions</a></li>
</ul>
</li>
<li><a href="#orgf45ea0b">1.4. Computing Weakest Preconditions</a>
<ul>
<li><a href="#org50225ed">1.4.1. Quick summary of Hoare rules</a></li>
<li><a href="#orgb24cc62">1.4.2. ASSIGNMENT</a></li>
<li><a href="#list">1.4.3. LIST of statements</a></li>
<li><a href="#org93fdbef">1.4.4. CONDITIONAL</a></li>
<li><a href="#orgf45c4c2">1.4.5. LOOP</a></li>
</ul>
</li>
<li><a href="#orgdb74700">1.5. Loop Invariants</a>
<ul>
<li><a href="#org7f14481">1.5.1. Where is the loop invariant <code>I</code>?</a></li>
<li><a href="#li">1.5.2. What is the loop invariant <code>I</code>?</a></li>
<li><a href="#li-to-use">1.5.3. Which loop invariants to use?</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-hoare" class="outline-2">
<h2 id="hoare"><span class="section-number-2">1.</span> Hoare logic</h2>
<div class="outline-text-2" id="text-hoare">
<p>
Method by <a href="https://en.wikipedia.org/wiki/Tony_Hoare">Tony Hoare</a> to verify that an imperative program is correct with respect to a given specification, i.e., reasoning about program correctness using <i>pre</i> and <i>post</i> conditions.  
</p>
</div>

<div id="outline-container-orgbd4c009" class="outline-3">
<h3 id="orgbd4c009"><span class="section-number-3">1.1.</span> Summary</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><b>Goal</b>: to prove that a program <code>S</code> is correct with respect to a given precondition <code>P</code> and postcondition <code>Q</code>.</li>
<li><b>Method</b>:
<ul class="org-ul">
<li>Use Hoare tripple to represent <code>S,P,Q</code> and prove the tripple</li>
<li>Compute <b>weakest precondition</b> of <code>S</code> with respect to <code>Q</code>, i.e., <code>wp(S, Q)</code></li>
<li>For every loop in <code>S</code>, need to provide a <b>loop invariant</b></li>
<li>Form <b>verification condition</b> (<b><code>vc</code></b>): <code>P =&gt; wp(S, Q)</code>
<ul class="org-ul">
<li>If this <code>vc</code> is true, then the Hoare tripple is valid, i.e., <code>S</code> is correct wrt to <code>P</code> and <code>Q</code></li>
<li>Else, Hoare tripple is invalid but we cannot conclude that <code>S</code>  is incorrect  wrt to <code>P</code> and <code>Q</code> (e.g., it could be that we picked a weak loop invariant)</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1c1d2b7" class="outline-3">
<h3 id="org1c1d2b7"><span class="section-number-3">1.2.</span> Hoare Tripple  <code>{P} S {Q}</code></h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><b>S</b>: a program (a list of statements); <b>P</b>: precondition (a <b>formula</b> that <i>holds</i> before the execution of <b>S</b>); <b>Q</b>: postcondition (a <b>formula</b> that <i>holds</i> after the execution of <b>S</b>)</li>
<li>Read: assume <code>P</code> holds, if <code>S</code> executes successfully (i.e., terminates), then <code>Q</code> holds</li>
<li>Meaning: if the tripple is <span class="underline">valid</span>, then <code>S</code> is correct wrt to the program specification (<code>P</code> and <code>Q</code>)</li>
<li>E.g., <code>{x = 5 and y &gt; 2} z := x + y; z := z + 2 {z &gt; 9}</code>:   assume <code>x=5 and y &gt; 2</code>, if <code>z:x +y; z := z + 2</code> runs successfully, then we have <code>z &gt; 9</code></li>
</ul>
</div>
</div>


<div id="outline-container-org07a8791" class="outline-3">
<h3 id="org07a8791"><span class="section-number-3">1.3.</span> Partial and Total Correctness</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><b>Partial</b>: assume <code>P</code> holds and <code>S</code> <i>successfully</i> executes, <code>Q</code> holds
<ul class="org-ul">
<li>Here, we <b>assume</b> <code>P</code> and the program terminates (<code>S</code> successfully executed)</li>
</ul></li>
<li><b>Total</b>: assume <code>P</code> holds, if  <code>S</code> <i>successfully</i> executes, then <code>Q</code> holds
<ul class="org-ul">
<li>Here, we <b>require</b> <code>S</code> terminates</li>
<li>Dififcult because having to ensure the termination of <code>S</code></li>
</ul></li>

<li>We often just use partial correctness because total correctness requires us to also prove that S would terminate, which is a difficult problem (theoretically undecidable).</li>
</ul>
</div>

<div id="outline-container-org4aed904" class="outline-4">
<h4 id="org4aed904"><span class="section-number-4">1.3.1.</span> Examples</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
<ol class="org-ol">
<li><a id="orgc93e7fd"></a>Consider a program <code>S</code> with a single assignment statement <code>x:=5</code>.<br>
<div class="outline-text-5" id="text-1-3-1-1">
<p>
The Hoare tripple <code>{True} x := 5 {x &gt; 6}</code> is <i>not</i> a valid tripple, but these next ones are valid:
</p>
<ol class="org-ol">
<li><code>{True} x := 5 {x=5 or x= 6 or x &gt; 6}</code></li>
<li><code>{True} x := 5 {x &gt; 1}</code></li>
<li><code>{True} x := 5 {x = 5}</code></li>
</ol>
<p>
Moreover, the postcondition in <code>x=5</code> is <b>strongest</b> because it is more precise than <code>x &gt; 1</code> and <code>(x=5 or x=6 or x &gt; 6)</code>.  In general we want the strongest (most precise) postcondition.
</p>
</div>
</li>


<li><a id="org1bad435"></a>Consider another program <code>z:= x/y</code><br>
<div class="outline-text-5" id="text-1-3-1-2">
<p>
These are valid Hoare tripples:
</p>

<ol class="org-ol">
<li><code>{x = 1 &amp; y = 2} z:= x/y  {z &lt; 1}</code></li>
<li><code>{x = 2 &amp; y = 4} z:= x/y {z &lt;1}</code></li>
<li><code>{0 &lt; x &lt; y &amp; y != 0} z:= x/y {z &lt;1}</code></li>
</ol>

<p>
Moreover, the precondition <code>0 &lt; x &lt; y &amp; y != 0</code> is the <b>weakest</b> precondition (i.e., it is the least constraint precondition). In general we want the weakest precondition.
</p>

<p>
These are invalid tripples:
</p>

<ol class="org-ol">
<li><code>{x &lt; y} z:= x/y  {z &lt; 1}</code> (counterexample input x=-1, y=0,  after executing z:=x/y, we do not have z &lt; 1 and instead got a div-by-0 exception)</li>
<li><code>{x = 0} z:= x/y  {z &lt; 1}</code> (counterexample input x=0, y=0)</li>
<li><code>{y != 0} z:= x/y  {z &lt; 1}</code> (counterexample input x=2 , y=1)</li>
<li><code>{x &lt; y &amp; y != 0} z:= x/y {z &lt;1}</code> (counterexample input   x=-2,  y=-1)</li>
</ol>
</div>
</li>
</ol>
</div>

<div id="outline-container-org10ecd00" class="outline-4">
<h4 id="org10ecd00"><span class="section-number-4">1.3.2.</span> In-class Questions</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Fill in <code>P,S,Q</code> to make the following Hoare tripples valid.
</p>

<ol class="org-ol">
<li><code>{Q} x:=3 {x = 8}</code></li>
<li><code>{P} x:= y - 3 {x = 8}</code></li>
<li><code>{x = y} S {x = y}</code></li>
<li><code>{x &lt; 0} while(x!=0) do x := x - 1 {Q}</code></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgf45ea0b" class="outline-3">
<h3 id="orgf45ea0b"><span class="section-number-3">1.4.</span> Computing Weakest Preconditions</h3>
<div class="outline-text-3" id="text-1-4">
<p>
We can automatically verify (partial) program correctness using Hoare Triples and weakest preconditions.
To prove <code>{P} S {Q}</code> is valid, i.e., to prove the program <code>S</code> is correct wrt to the precondition <code>P</code> and postcondition <code>Q</code>, we check that <code>P =&gt; wp(S, Q)</code> is valid. Here, the function <b>wp</b> returns the weakest precondition allowing the program <code>S</code> to achieve the postcondition <code>Q</code>.
</p>

<p>
Thus, to show the validity of <code>{P} S {Q}</code>, we show that <code>P</code> implies (<code>=&gt;</code>) the WP of <code>S</code> wrt to <code>Q</code>. Hoare defines rules to obtain the WP of different kind of (imperative) program statements as shown below.
</p>
</div>
