people/nguyenthanhvuh/old/drafts/program-analysis-notes.org
*** Quick summary of Hoare rules


|           Statement |          ~S~           |                 ~wp(S, Q)~                 | Comment                                                                  |
|                 <r> |          <c>           |                    <c>                     | <l>                                                                      |
|          [[ASSIGNMENT][Assignment]] |        ~x := E~        |                  ~Q[x/E]~                  | replace all occurences of the variable ~x~ in ~Q~ with the expresion ~E~ |
| [[#list][List of Assignments]] |        ~S1;S2~         |             ~wp(S1, wp(S2,Q))~             |                                                                          |
|         [[CONDITIONAL][Conditional]] | ~if b then S1 else S2~ |      ~b => wp(S1,Q) & !b => wp(S2,Q)~      |                                                                          |
|                [[LOOP][Loop]] |     ~while b do S~     | ~(I) & (I & B => wp(S,I)) & (I & !B => Q)~ | ~I~ is a user supplied _loop invariant_                                  |
|---------------------+------------------------+--------------------------------------------+--------------------------------------------------------------------------|

*** ASSIGNMENT
An ~assignment~ statement ~x := E~ is one of the most popular types of statement.  It assigns the value of an expression ~E~ to a variable ~x~. The WP for an assignment ~wp(x:=E,Q)~ is obtained by substituting all occurences of ~x~ in ~Q~ with the expression ~E~.

#+begin_src 
WP(x := E, Q) = Q[x/E]
#+end_src

Example:
#+begin_src 
WP(x:=3, x + y = 10)
= 3 + y = 10 
= y = 7
Thus, we have {y=7} x := 3 {x + y = 10}
#+end_src

#+begin_src 
WP(x:=3, {x + y > 0) 
= 3 + y > 0  
= y > -3
Thus, we have {y > -3}  x := 3 {x + y> 0}
#+end_src

*** LIST of statements
   :PROPERTIES:
   :CUSTOM_ID: list
   :END:
   
A list of sequential statements. The WP for list is defined /recursively/ as follows.

#+begin_src
WP([S1; S2; S3 ...;]  Q) = WP(S1, WP(S2;S3;.., Q))
WP([], Q) = Q
#+end_src

Example:
#+begin_src 
WP([x:=x+1; y:=y*x], y=2*z) 
=   WP(x:=x+1, WP([y:=y*x], y=2*z))
=   WP(x:=x+1, y*x=2*z)
=   y*(x+1)=2*z
Thus, we have {y*(x+1)=2*z}  x:=x+1; y:=y*x {y=2*z}
#+end_src

*** CONDITIONAL

The WP of a conditional statement ~if b then S1 else S2, Q~ combines the WPs of ~S1~ and ~S2~.

#+begin_src 
  WP(if b then S1 else S2, Q)  =  (b => WP(S1,Q))  &  (!b => WP(S2, Q))
#+end_src

Example:
#+begin_src
WP(if x > 0 then y := x + 2  else y := y + 1,  y > x) 
= (x>0 => WP(y:=y+x, y>x) & (x<=0 => WP(y:=y+1, y>x))
= (x>0 => y+x>x)  &  (x <= 0  =>  y+1>x)
= x>0 => y>0  & x<=0 => y+1>x
#+end_src

#+begin_src
  WP(if x > 0 then y :=x  else y:= 0,  y > 0) 
  = (x>0 => WP(y:=x, y >0)) & (x<=0 => WP(y:=0, y>0))
  = (x > 0 => x > 0)  &  (x <= 0  =>  0 > 0)
  = True & x > 0   
  = x > 0 # (0> 0 is false,  and so !(x<=0) or false is !(x<=0) = x>0)
#+end_src
  
Note: Instead of using ~=>~ (imply), which might be confusing to some, we can use just ~!~ (not) and ~||~ (or)
#+begin_src 
WP(if b then S1 else S2, Q)
=  (b => WP(S1,Q))  &  (!b => WP(S2, Q))
=  !((b & !WP(S1,Q))  ||  (!b & !WP(S2, Q)))
#+end_src
         
*** LOOP
Unlike other statements where we have rules to compute WP automatically, for loop, we (the user) need to supply a /loop invariant/ ~I~to obtain the WP of loop. This [[Loop Invariants][subsection]] describes loop invariants.  The WP for loop is:

#+begin_src 
  WP(while [I] b do S, Q) =  I & (I & b => WP(S,I) & (I & !b)  => Q)
#+end_src
As can be seen, the WP for loop consists of 3 conjuncts:
  1. ~I~ :  the loop invariant (should hold when entering the loop)
  1. ~(I & b)  =>   I~ : (entering the loop because ~b~ is true) ~I~ is preserved after each loop body execution 
  1. ~(I & !b) =>  Q~  (exiting the loop because ~b~ is false), when exiting the loop, the post condition holds  

Thus, to compute WP for loop, you would need to come up with invariants. Moreover, as [[Loop Invariants][mentioned]], we will need to pick a sufficiently strong loop invariants to be able to prove the program. Note that we will always able to create the weakest WP, but it might not be good enough to prove the program at the end.

Below we demonstrate the computation of WPs using sufficiently and insufficiently strong invariants. We use the same example program used [[#li][here]]:
#+begin_src c
  // {N >= 0} 
  i := 0;
  while(true){
    // [I]: loop invariants here
    if(!i < N) break;
    i := N;
  }
  // {i = N} // post condition
#+end_src

This program has several loop invariants at ~[I]~ including  ~N >= 0, i>=0, i <= N~.  Also, the program can be written as ~S: i := 0; while[i<=N] i < N do i:= N]~, with precondition ~P: N >= 0~ and postcondition ~Q: i==N~.

