docs/nguyen/posts/program-analysis-notes.html
<div id="outline-container-org50225ed" class="outline-4">
<h4 id="org50225ed"><span class="section-number-4">1.4.1.</span> Quick summary of Hoare rules</h4>
<div class="outline-text-4" id="text-1-4-1">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-center">

<col  class="org-center">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">Statement</td>
<td class="org-center"><code>S</code></td>
<td class="org-center"><code>wp(S, Q)</code></td>
<td class="org-left">Comment</td>
</tr>

<tr>
<td class="org-right"><a href="#orgb24cc62">Assignment</a></td>
<td class="org-center"><code>x := E</code></td>
<td class="org-center"><code>Q[x/E]</code></td>
<td class="org-left">replace all occurences of the variable <code>x</code> in <code>Q</code> with the expresion <code>E</code></td>
</tr>

<tr>
<td class="org-right"><a href="#list">List of Assignments</a></td>
<td class="org-center"><code>S1;S2</code></td>
<td class="org-center"><code>wp(S1, wp(S2,Q))</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right"><a href="#org93fdbef">Conditional</a></td>
<td class="org-center"><code>if b then S1 else S2</code></td>
<td class="org-center"><code>b =&gt; wp(S1,Q) &amp; !b =&gt; wp(S2,Q)</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right"><a href="#orgf45c4c2">Loop</a></td>
<td class="org-center"><code>while b do S</code></td>
<td class="org-center"><code>(I) &amp; (I &amp; B =&gt; wp(S,I)) &amp; (I &amp; !B =&gt; Q)</code></td>
<td class="org-left"><code>I</code> is a user supplied <span class="underline">loop invariant</span></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb24cc62" class="outline-4">
<h4 id="orgb24cc62"><span class="section-number-4">1.4.2.</span> ASSIGNMENT</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
An <code>assignment</code> statement <code>x := E</code> is one of the most popular types of statement.  It assigns the value of an expression <code>E</code> to a variable <code>x</code>. The WP for an assignment <code>wp(x:=E,Q)</code> is obtained by substituting all occurences of <code>x</code> in <code>Q</code> with the expression <code>E</code>.
</p>

<pre class="example">
WP(x := E, Q) = Q[x/E]
</pre>

<p>
Example:
</p>
<pre class="example">
WP(x:=3, x + y = 10)
= 3 + y = 10 
= y = 7
Thus, we have {y=7} x := 3 {x + y = 10}
</pre>

<pre class="example">
WP(x:=3, {x + y &gt; 0) 
= 3 + y &gt; 0  
= y &gt; -3
Thus, we have {y &gt; -3}  x := 3 {x + y&gt; 0}
</pre>
</div>
</div>

<div id="outline-container-list" class="outline-4">
<h4 id="list"><span class="section-number-4">1.4.3.</span> LIST of statements</h4>
<div class="outline-text-4" id="text-list">
<p>
A list of sequential statements. The WP for list is defined <i>recursively</i> as follows.
</p>

<pre class="example">
WP([S1; S2; S3 ...;]  Q) = WP(S1, WP(S2;S3;.., Q))
WP([], Q) = Q
</pre>

<p>
Example:
</p>
<pre class="example">
WP([x:=x+1; y:=y*x], y=2*z) 
=   WP(x:=x+1, WP([y:=y*x], y=2*z))
=   WP(x:=x+1, y*x=2*z)
=   y*(x+1)=2*z
Thus, we have {y*(x+1)=2*z}  x:=x+1; y:=y*x {y=2*z}
</pre>
</div>
</div>

<div id="outline-container-org93fdbef" class="outline-4">
<h4 id="org93fdbef"><span class="section-number-4">1.4.4.</span> CONDITIONAL</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
The WP of a conditional statement <code>if b then S1 else S2, Q</code> combines the WPs of <code>S1</code> and <code>S2</code>.
</p>

<pre class="example">
WP(if b then S1 else S2, Q)  =  (b =&gt; WP(S1,Q))  &amp;  (!b =&gt; WP(S2, Q))
</pre>

<p>
Example:
</p>
<pre class="example">
WP(if x &gt; 0 then y := x + 2  else y := y + 1,  y &gt; x) 
= (x&gt;0 =&gt; WP(y:=y+x, y&gt;x) &amp; (x&lt;=0 =&gt; WP(y:=y+1, y&gt;x))
= (x&gt;0 =&gt; y+x&gt;x)  &amp;  (x &lt;= 0  =&gt;  y+1&gt;x)
= x&gt;0 =&gt; y&gt;0  &amp; x&lt;=0 =&gt; y+1&gt;x
</pre>

<pre class="example">
WP(if x &gt; 0 then y :=x  else y:= 0,  y &gt; 0) 
= (x&gt;0 =&gt; WP(y:=x, y &gt;0)) &amp; (x&lt;=0 =&gt; WP(y:=0, y&gt;0))
= (x &gt; 0 =&gt; x &gt; 0)  &amp;  (x &lt;= 0  =&gt;  0 &gt; 0)
= True &amp; x &gt; 0   
= x &gt; 0 # (0&gt; 0 is false,  and so !(x&lt;=0) or false is !(x&lt;=0) = x&gt;0)
</pre>

<p>
Note: Instead of using <code>=&gt;</code> (imply), which might be confusing to some, we can use just <code>!</code> (not) and <code>||</code> (or)
</p>
<pre class="example">
WP(if b then S1 else S2, Q)
=  (b =&gt; WP(S1,Q))  &amp;  (!b =&gt; WP(S2, Q))
=  !((b &amp; !WP(S1,Q))  ||  (!b &amp; !WP(S2, Q)))
</pre>
</div>
</div>

<div id="outline-container-orgf45c4c2" class="outline-4">
<h4 id="orgf45c4c2"><span class="section-number-4">1.4.5.</span> LOOP</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
Unlike other statements where we have rules to compute WP automatically, for loop, we (the user) need to supply a <i>loop invariant</i> ~I~to obtain the WP of loop. This <a href="#orgdb74700">subsection</a> describes loop invariants.  The WP for loop is:
</p>

<pre class="example">
WP(while [I] b do S, Q) =  I &amp; (I &amp; b =&gt; WP(S,I) &amp; (I &amp; !b)  =&gt; Q)
</pre>
<p>
As can be seen, the WP for loop consists of 3 conjuncts:
</p>
<ol class="org-ol">
<li><code>I</code> :  the loop invariant (should hold when entering the loop)</li>
<li><code>(I &amp; b)  =&gt;   I</code> : (entering the loop because <code>b</code> is true) <code>I</code> is preserved after each loop body execution</li>
<li><code>(I &amp; !b) =&gt;  Q</code>  (exiting the loop because <code>b</code> is false), when exiting the loop, the post condition holds</li>
</ol>

<p>
Thus, to compute WP for loop, you would need to come up with invariants. Moreover, as <a href="#orgdb74700">mentioned</a>, we will need to pick a sufficiently strong loop invariants to be able to prove the program. Note that we will always able to create the weakest WP, but it might not be good enough to prove the program at the end.
</p>

<p>
Below we demonstrate the computation of WPs using sufficiently and insufficiently strong invariants. We use the same example program used <a href="#li">here</a>:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{N &gt;= 0} </span>
<span style="color: #b751b6;">i</span> := 0;
<span style="color: #e45649;">while</span>(<span style="color: #b751b6;">true</span>){
  <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">[I]: loop invariants here</span>
  <span style="color: #e45649;">if</span>(<span style="color: #4078f2; font-weight: bold;">!</span>i &lt; N) <span style="color: #e45649;">break</span>;
  <span style="color: #b751b6;">i</span> := N;
}
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{i = N} // post condition</span>
</pre>
</div>

<p>
This program has several loop invariants at <code>[I]</code> including  <code>N &gt;= 0, i&gt;=0, i &lt;= N</code>.  Also, the program can be written as <code>S: i := 0; while[i&lt;=N] i &lt; N do i:= N]</code>, with precondition <code>P: N &gt;= 0</code> and postcondition <code>Q: i==N</code>.
</p>
</div>

<ol class="org-ol">
