people/nguyenthanhvuh/old/drafts/program-analysis-notes.org
**** Example: using a /sufficiently/ strong invariant
Here, we use the loop invariant ~i <= N~ to prove ~S~ is correct wrt to ~P,Q~. As we will see, this loop invariant is sufficiently strong because it allows us to prove the program.
1. Apply the WP to the program, which is a list of statements.
   #+begin_src
   WP([i := 0; while[i<=N] i < N do i:= N], i = N) 
   = WP(i := 0; WP(while[i<=N] i < N do i:=N], i = N)  //WP rule for list of statements
   #+end_src
1. Apply the WP to ~while~ 
   #+begin_src
   // Let's first compute WP(while[i<=N] i < N do i:=N, {i = N}). According to the WP rule for LOOP, we will have 3 conjuncts 
   1. i <= N
 
   2. (i <= N & i < N) => WP(i:=N, {i<=N})
      = i < N          =>  N <= N 
      = i < N          =>  True   
      = True     // because !(i<N) or True  is true (anything or with true is true)
 
   3. (i <= N & !(i<N)) => i = N
      = i = N           => i = N
      = True     // because !(i=N) | i = n  is True (a or !a is True)
 
   =  i <= N & True & True
   =  i <= N
   #+end_src
1. After obtaining the WP ~i<=N~ for ~while~, we continue with ~WP(i:=0, i<=N)~
   #+begin_src 
   // WP([i := 0; while[i<=N] i < N do i:= N], i = N) = WP(i := 0, i<=N)
   WP(i := 0, i<=N)
   = 0<=N  //WP rule for assignment
   #+end_src
1. Now we construct a /verification condition/ (~vc~) to check that the given precondition ~P: N >= 0~ implies the WP ~0<=N~
   #+begin_src 
   P => WP([i := 0; while[i<=N] i < N do i:= N], {i = N}) 
   = N>=0 =>  0<=N   // N>=0 is the given precondition and 0 <= N is the WP we obtain above for the program
   = True
   #+end_src
   Because te given precondition ~N>=0~ implies ~0<=N~, the Hoare tripple is valid, i.e., the program is correct.
1. Also, the loop invariant ~i <= N~ is thus *sufficiently strong* to let us prove the program satisfy the specifications.

**** Example 2: using an /insufficiently/ strong invariant
Here, we use the loop invariant ~N >= 0~ to prove program. As we will see, this loop invariant is not sufficiently strong because we will not be able to use it to prove the program.

1. Apply the WP to ~while~
     #+begin_src 
      WP(while[N >= 0] i < N do i:=N, {i = N})
      =
        1. N >= 0
        2. (N >=0 & i < N) => WP(i := N, N >= 0) = 
           (N >=0 & i < N) => i >= 0   // we can't simplify much, so just leave as is

        3. N >=0 & !(i<N) => i =N
           (N >= 0 & i >= N) => i = N
           i>= 0  => i = N  // we can't simplify much, so just leave as is

        =  N >=0 & (N >=0 & i < N) => i >= 0 & (i>= 0  => i = N)

      WP(i:=0; {N >=0 & (N >=0 & i < N) => i >= 0 & (i>= 0  => i = N)})
        = (0 >= 0) & (0 >= 0 & 0 < N => 0 >= 0) & (0>=0 => 0 = N)  //apply WP for assignment and simplify
        =  TRUE    &      TRUE                  & 0 = N
        = 0 = N
      #+end_src
2. Obtain the ~vc~
   #+begin_src 
   P => 0 = N  // the given precondition implies 0 = N
   (N >= 0) => 0 = N  // This is not valid, e.g., counterexample N=3
   #+end_src
   The ~vc~ is not valid and thus we were not able to prove the Hoare triple and hence do not know whether the program is correct or not.
3. Thus this loop invariant is not sufficiently strong for us to prove the program.

   *Important*: as mentioned [[#li-to-use][here]], not being able to prove simply means we cannot prove it using this loop invariant.  It *does not* mean that you disprove it or show that the Hoare triple is invalid.  (in fact, we know the Hoare tripple is valid if we used a different loop invariant, e.g., i <= N )


** Loop Invariants
At a high level, loop invariant capture the meaning of the loop, and thus help understand and reason about the loop. They are especially helpful for automatic verification (e.g., using [[#hoare][Hoare]] logic)

A loop invariant is a property ~I~ that always holds at the *loop entrance*. This means that ~I~  (i) holds when the loop entered and (ii) is preserved after the loop body is executed (i.e., ~I~ is an inductive loop invariant).

*** Where is the loop invariant ~I~?

If you have a loop that looks like
#+begin_src
while (b){
  // I 
  //loop body
}
#+end_src

It is useful to transform it to this equivalent form
#+begin_src c
while (True){
  // [I] : loop invariant I is right here
  if (!b) break
  //loop body
}
#+end_src

Then the loop invariant ~I~ is right when you enter the loop, as indicated by ~[I]~ in the code above.

Note that ~I~ is not located *after* the guard condition ~b~ is satisfied, e.g., 
#+begin_src c
while (b){
  //[I]  : incorrect location for loop invariant
  //loop body
}
#+end_src


*** What is the loop invariant ~I~?
:PROPERTIES:
:CUSTOM_ID: li
:END:


We will use an example to demonstrate loop invariants. Consider a simple program

#+begin_src c
  // {N >= 0} 
  i := 0;
  while(i < N){
    i := N;
  }
  // {i = N} // post condition
#+end_src

To make it easier to see where loop invariants are, we first transform this program into an equivalent one:

#+begin_src c
  // {N >= 0} 
  i := 0;
  while(true){
    // [I]: loop invariants here
    if(!i < N) break;
    i := N;
  }
  // {i = N} // post condition
#+end_src


The ~while~ loop in this program has many possible loop invariants (any property that is true at ~[I]~):
1. ~true~ : is always a loop invariant, but it is very weak and trivial, i.e., almost useless for any analysis
1. ~N >= 0~:  because ~N>0~ is a precondition and ~N~ is never changed
1. ~i>=0~: because ~i~ is initalized to ~0~ can only changed to ~N~, which itself is ~>=0~ and never changed.
1. ~i <= N~: because ~i~ can only either be ~0~ or ~N~, and ~N >=0~.

