docs/nguyen/posts/program-analysis-notes.html
<li><a id="org3fac7f9"></a>Example: using a <i>sufficiently</i> strong invariant<br>
<div class="outline-text-5" id="text-1-4-5-1">
<p>
Here, we use the loop invariant <code>i &lt;= N</code> to prove <code>S</code> is correct wrt to <code>P,Q</code>. As we will see, this loop invariant is sufficiently strong because it allows us to prove the program.
</p>
<ol class="org-ol">
<li><p>
Apply the WP to the program, which is a list of statements.
</p>
<pre class="example">
WP([i := 0; while[i&lt;=N] i &lt; N do i:= N], i = N) 
= WP(i := 0; WP(while[i&lt;=N] i &lt; N do i:=N], i = N)  //WP rule for list of statements
</pre></li>
<li><p>
Apply the WP to <code>while</code> 
</p>
<pre class="example">
// Let's first compute WP(while[i&lt;=N] i &lt; N do i:=N, {i = N}). According to the WP rule for LOOP, we will have 3 conjuncts 
1. i &lt;= N

2. (i &lt;= N &amp; i &lt; N) =&gt; WP(i:=N, {i&lt;=N})
   = i &lt; N          =&gt;  N &lt;= N 
   = i &lt; N          =&gt;  True   
   = True     // because !(i&lt;N) or True  is true (anything or with true is true)

3. (i &lt;= N &amp; !(i&lt;N)) =&gt; i = N
   = i = N           =&gt; i = N
   = True     // because !(i=N) | i = n  is True (a or !a is True)

=  i &lt;= N &amp; True &amp; True
=  i &lt;= N
</pre></li>
<li><p>
After obtaining the WP <code>i&lt;=N</code> for <code>while</code>, we continue with <code>WP(i:=0, i&lt;=N)</code>
</p>
<pre class="example">
// WP([i := 0; while[i&lt;=N] i &lt; N do i:= N], i = N) = WP(i := 0, i&lt;=N)
WP(i := 0, i&lt;=N)
= 0&lt;=N  //WP rule for assignment
</pre></li>
<li><p>
Now we construct a <i>verification condition</i> (<code>vc</code>) to check that the given precondition <code>P: N &gt;= 0</code> implies the WP <code>0&lt;=N</code>
</p>
<pre class="example">
P =&gt; WP([i := 0; while[i&lt;=N] i &lt; N do i:= N], {i = N}) 
= N&gt;=0 =&gt;  0&lt;=N   // N&gt;=0 is the given precondition and 0 &lt;= N is the WP we obtain above for the program
= True
</pre>
<p>
Because te given precondition <code>N&gt;=0</code> implies <code>0&lt;=N</code>, the Hoare tripple is valid, i.e., the program is correct.
</p></li>
<li>Also, the loop invariant <code>i &lt;= N</code> is thus <b>sufficiently strong</b> to let us prove the program satisfy the specifications.</li>
</ol>
</div>
</li>

<li><a id="org8a89d84"></a>Example 2: using an <i>insufficiently</i> strong invariant<br>
<div class="outline-text-5" id="text-1-4-5-2">
<p>
Here, we use the loop invariant <code>N &gt;= 0</code> to prove program. As we will see, this loop invariant is not sufficiently strong because we will not be able to use it to prove the program.
</p>

<ol class="org-ol">
<li><p>
Apply the WP to <code>while</code>
</p>
<pre class="example">
WP(while[N &gt;= 0] i &lt; N do i:=N, {i = N})
=
  1. N &gt;= 0
  2. (N &gt;=0 &amp; i &lt; N) =&gt; WP(i := N, N &gt;= 0) = 
     (N &gt;=0 &amp; i &lt; N) =&gt; i &gt;= 0   // we can't simplify much, so just leave as is

  3. N &gt;=0 &amp; !(i&lt;N) =&gt; i =N
     (N &gt;= 0 &amp; i &gt;= N) =&gt; i = N
     i&gt;= 0  =&gt; i = N  // we can't simplify much, so just leave as is

  =  N &gt;=0 &amp; (N &gt;=0 &amp; i &lt; N) =&gt; i &gt;= 0 &amp; (i&gt;= 0  =&gt; i = N)

WP(i:=0; {N &gt;=0 &amp; (N &gt;=0 &amp; i &lt; N) =&gt; i &gt;= 0 &amp; (i&gt;= 0  =&gt; i = N)})
  = (0 &gt;= 0) &amp; (0 &gt;= 0 &amp; 0 &lt; N =&gt; 0 &gt;= 0) &amp; (0&gt;=0 =&gt; 0 = N)  //apply WP for assignment and simplify
  =  TRUE    &amp;      TRUE                  &amp; 0 = N
  = 0 = N
</pre></li>
<li><p>
Obtain the <code>vc</code>
</p>
<pre class="example">
P =&gt; 0 = N  // the given precondition implies 0 = N
(N &gt;= 0) =&gt; 0 = N  // This is not valid, e.g., counterexample N=3
</pre>
<p>
The <code>vc</code> is not valid and thus we were not able to prove the Hoare triple and hence do not know whether the program is correct or not.
</p></li>
<li><p>
Thus this loop invariant is not sufficiently strong for us to prove the program.
</p>

<p>
<b>Important</b>: as mentioned <a href="#li-to-use">here</a>, not being able to prove simply means we cannot prove it using this loop invariant.  It <b>does not</b> mean that you disprove it or show that the Hoare triple is invalid.  (in fact, we know the Hoare tripple is valid if we used a different loop invariant, e.g., i &lt;= N )
</p></li>
</ol>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-orgdb74700" class="outline-3">
<h3 id="orgdb74700"><span class="section-number-3">1.5.</span> Loop Invariants</h3>
<div class="outline-text-3" id="text-1-5">
<p>
At a high level, loop invariant capture the meaning of the loop, and thus help understand and reason about the loop. They are especially helpful for automatic verification (e.g., using <a href="#hoare">Hoare</a> logic)
</p>

<p>
A loop invariant is a property <code>I</code> that always holds at the <b>loop entrance</b>. This means that <code>I</code>  (i) holds when the loop entered and (ii) is preserved after the loop body is executed (i.e., <code>I</code> is an inductive loop invariant).
</p>
</div>

<div id="outline-container-org7f14481" class="outline-4">
<h4 id="org7f14481"><span class="section-number-4">1.5.1.</span> Where is the loop invariant <code>I</code>?</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
If you have a loop that looks like
</p>
<pre class="example">
while (b){
  // I 
  //loop body
}
</pre>

<p>
It is useful to transform it to this equivalent form
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #e45649;">while</span> (True){
  <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">[I] : loop invariant I is right here</span>
  <span style="color: #e45649;">if</span> (<span style="color: #4078f2; font-weight: bold;">!</span>b) <span style="color: #e45649;">break</span>
  <span style="color: #9ca0a4;">//</span><span style="color: #9ca0a4;">loop body</span>
}
</pre>
</div>

<p>
Then the loop invariant <code>I</code> is right when you enter the loop, as indicated by <code>[I]</code> in the code above.
</p>

<p>
Note that <code>I</code> is not located <b>after</b> the guard condition <code>b</code> is satisfied, e.g., 
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #e45649;">while</span> (b){
  <span style="color: #9ca0a4;">//</span><span style="color: #9ca0a4;">[I]  : incorrect location for loop invariant</span>
  <span style="color: #9ca0a4;">//</span><span style="color: #9ca0a4;">loop body</span>
}
</pre>
</div>
</div>
</div>


<div id="outline-container-li" class="outline-4">
<h4 id="li"><span class="section-number-4">1.5.2.</span> What is the loop invariant <code>I</code>?</h4>
<div class="outline-text-4" id="text-li">
<p>
We will use an example to demonstrate loop invariants. Consider a simple program
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{N &gt;= 0} </span>
<span style="color: #b751b6;">i</span> := 0;
<span style="color: #e45649;">while</span>(i &lt; N){
  <span style="color: #b751b6;">i</span> := N;
}
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{i = N} // post condition</span>
</pre>
</div>

<p>
To make it easier to see where loop invariants are, we first transform this program into an equivalent one:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{N &gt;= 0} </span>
<span style="color: #b751b6;">i</span> := 0;
<span style="color: #e45649;">while</span>(<span style="color: #b751b6;">true</span>){
  <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">[I]: loop invariants here</span>
  <span style="color: #e45649;">if</span>(<span style="color: #4078f2; font-weight: bold;">!</span>i &lt; N) <span style="color: #e45649;">break</span>;
  <span style="color: #b751b6;">i</span> := N;
}
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{i = N} // post condition</span>
</pre>
</div>


<p>
The <code>while</code> loop in this program has many possible loop invariants (any property that is true at <code>[I]</code>):
</p>
<ol class="org-ol">
<li><code>true</code> : is always a loop invariant, but it is very weak and trivial, i.e., almost useless for any analysis</li>
<li><code>N &gt;= 0</code>:  because <code>N&gt;0</code> is a precondition and <code>N</code> is never changed</li>
<li><code>i&gt;=0</code>: because <code>i</code> is initalized to <code>0</code> can only changed to <code>N</code>, which itself is <code>&gt;=0</code> and never changed.</li>
<li><code>i &lt;= N</code>: because <code>i</code> can only either be <code>0</code> or <code>N</code>, and <code>N &gt;=0</code>.</li>
</ol>
</div>
</div>
