people/nguyenthanhvuh/old/drafts/program-analysis-notes.org
*** Which loop invariants to use?
:PROPERTIES:
:CUSTOM_ID: li-to-use
:END:

An important question to ask is which of these invariants are useful?  Typically, the more stronger the better as they capture the meaning of the loop more precisely (thus ~true~ is not very useful).  However, the answer really depends on the task we are trying to achieve.  If the task is to prove a very weak property, then we might not need strong loop invariants, e.g., for instance to prove that ~N >= 0~ as the postcondition, then we only need the loop invariant ~N >= 0~.  Vice versa, if the task is to prove a strong property such as ~i=N~, then we likely need strong loop invariants, e.g., ~i<=N~.

In many cases, we can guess which loop invariants are useful based on the postconditions we want to prove. However, in the general cases we do not know a priori which loop invariants to use.  If the program is indeed correct wrt the specs (i.e., the representing Hoare tripple is valid), there are two possible scenarios about using loop invariants to prove programs:
1. if we use sufficiently strong loop invariants, then we will be able to prove the program is correct.
1. if we use insufficiently strong loop invariants, then we will /not/ be able to prove the program is correct.  
The [[LOOP][loop]] section in Hoare logic gives concrete examples demonstrating these two cases.

Thus, this gives an *crucial* observation:  if we can prove that a program is correct (e.g., using Hoare logic), then it is really correct.  However, if we cannot prove that the program is correct, then we do not know whether the program is correct or not (it could really be wrong,  or it is actually correct but we can't prove it because we use rather weak loop invariants).


 
