docs/nguyen/posts/program-analysis-notes.html

<div id="outline-container-li-to-use" class="outline-4">
<h4 id="li-to-use"><span class="section-number-4">1.5.3.</span> Which loop invariants to use?</h4>
<div class="outline-text-4" id="text-li-to-use">
<p>
An important question to ask is which of these invariants are useful?  Typically, the more stronger the better as they capture the meaning of the loop more precisely (thus <code>true</code> is not very useful).  However, the answer really depends on the task we are trying to achieve.  If the task is to prove a very weak property, then we might not need strong loop invariants, e.g., for instance to prove that <code>N &gt;= 0</code> as the postcondition, then we only need the loop invariant <code>N &gt;= 0</code>.  Vice versa, if the task is to prove a strong property such as <code>i=N</code>, then we likely need strong loop invariants, e.g., <code>i&lt;=N</code>.
</p>

<p>
In many cases, we can guess which loop invariants are useful based on the postconditions we want to prove. However, in the general cases we do not know a priori which loop invariants to use.  If the program is indeed correct wrt the specs (i.e., the representing Hoare tripple is valid), there are two possible scenarios about using loop invariants to prove programs:
</p>
<ol class="org-ol">
<li>if we use sufficiently strong loop invariants, then we will be able to prove the program is correct.</li>
<li>if we use insufficiently strong loop invariants, then we will <i>not</i> be able to prove the program is correct.</li>
</ol>
<p>
The <a href="#orgf45c4c2">loop</a> section in Hoare logic gives concrete examples demonstrating these two cases.
</p>

<p>
Thus, this gives an <b>crucial</b> observation:  if we can prove that a program is correct (e.g., using Hoare logic), then it is really correct.  However, if we cannot prove that the program is correct, then we do not know whether the program is correct or not (it could really be wrong,  or it is actually correct but we can't prove it because we use rather weak loop invariants).
</p>
</div>
</div>
</div>
</div>
<div class="taglist"><a href="./tags.html">Tags</a>: <a href="./tag-program-analysis.html">program-analysis</a> <a href="./tag-notes.html">notes</a> <a href="./tag-blog.html">blog</a> </div></div>
<div id="postamble" class="status"><!-- <div id="archive"><a href="archive.html">Other posts</a></div>  -->
</div>
</body>
</html>
